# Add Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerTable..::..Add Method
ExportLayerTable Class See Also
---
Inserts a (key,info) pair into Export layer table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Add(
	ExportLayerKey exportLayerKey,
	ExportLayerInfo exportLayerInfo
)
```

Visual Basic
---
```text
Public Sub Add ( _
	exportLayerKey As ExportLayerKey, _
	exportLayerInfo As ExportLayerInfo _
)
```

Visual C++
---
```text
public:
void Add(
	ExportLayerKey^ exportLayerKey,
	ExportLayerInfo^ exportLayerInfo
)
```

# ### Parameters
exportLayerKey
    Type: Autodesk.Revit.DB..::..ExportLayerKey The export layer key to be added.
exportLayerInfo
    Type: Autodesk.Revit.DB..::..ExportLayerInfo The export layer info to be added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The key already exists in the table. -or- The layer info does not contain the Category as a modifier type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLayerTable Class
Autodesk.Revit.DB Namespace